Sync docs from herd@e82527e
